# Дан список чисел. Определите, сколько
# в нем встречается различных чисел.

spisok = [1, 1, 3, -1, 4, 4]
amount = len(set(spisok))
print(amount)